unit uDBviewer_TuneDBconst;

interface
const
  pc006_102_jMain       = 6102;
  pc006_102_Caption     = 'Настройка связи с БД';

  pc006_102_001         = 'sa';
  pc006_102_002         = 'Проверка связи с сервером завершилась успешно';
  pc006_102_003         = 'Проверка связи с сервером завершилась с ошибкой:' + #13#10 +
                          '--------------------' + #13#10;
  pc006_102_004         = 'Обнаружена ошибка в поле "%s". Исправьте, пожалуйста';
  pc006_102_005           = 'Количество попыток чтения данных лежит в диапазоне от 1 до %d. Исправьте, пожалуйста';

implementation

end.
