unit uDBVreportQueryconst;

interface
const
  pc006_104_jMain       = 6104;
  pc006_104_Caption     = 'Подготовить запрос к БД';

  pc006_104_0001           = 'Ввод имени БД';
  pc006_104_0002           = 'Образец имени:';
  pc006_104_0003           = 'db_2012_05_23_17_09_53';
  pc006_104_0004           = 'Выберите, пожалуйста, БД, которую вы хотите удалить из списка';
  pc006_104_0005           = '%d (%s)';

  pc006_104_1101           = 'Обнаружена ошибка в поле "День (начало периода)". Исправьте, пожалуйста';
  pc006_104_1102           = 'Обнаружена ошибка в поле "Месяц (начало периода)". Исправьте, пожалуйста';
  pc006_104_1103           = 'Обнаружена ошибка в поле "Год (начало периода)". Исправьте, пожалуйста';
  pc006_104_1104           = 'Указана неверная дата начала периода. Исправьте, пожалуйста';
  pc006_104_1105           = 'Обнаружена ошибка в поле "Час (начало периода)". Исправьте, пожалуйста';
  pc006_104_1106           = 'Обнаружена ошибка в поле "Мин (начало периода)". Исправьте, пожалуйста';
  pc006_104_1107           = 'Обнаружена ошибка в поле "День (дата начала бурения)". Исправьте, пожалуйста';
  pc006_104_1108           = 'Обнаружена ошибка в поле "Месяц (дата начала бурения)". Исправьте, пожалуйста';
  pc006_104_1109           = 'Обнаружена ошибка в поле "Год (дата начала бурения)". Исправьте, пожалуйста';
  pc006_104_1110           = 'Обнаружена ошибка в поле "%s". Исправьте, пожалуйста';
  pc006_104_1111           = 'Обнаружена ошибка в поле "День (конец периода)". Исправьте, пожалуйста';
  pc006_104_1112           = 'Обнаружена ошибка в поле "Месяц (конец периода)". Исправьте, пожалуйста';
  pc006_104_1113           = 'Обнаружена ошибка в поле "Год (конец периода)". Исправьте, пожалуйста';
  pc006_104_1114           = 'Указана неверная дата конца периода. Исправьте, пожалуйста';
  pc006_104_1115           = 'Обнаружена ошибка в поле "Час (конец периода)". Исправьте, пожалуйста';
  pc006_104_1116           = 'Конец периода раньше начала периода. Исправьте, пожалуйста';
  pc006_104_1117           = 'Извините, программа создаёт отчёт только за сутки. Исправьте, пожалуйста';
  pc006_104_1118           = 'Обнаружена ошибка в поле "Мин (конец периода)". Исправьте, пожалуйста';
  pc006_104_1119           = 'Вы не выбрали ни одной Базы Данных для рисования графиков. Исправьте, пожалуйста';
  pc006_104_1120           = 'Указана неверная дата начала бурения. Исправьте, пожалуйста';
  pc006_104_1121           = 'Вы не выбрали ни одного параметра для рисования графиков. Исправьте, пожалуйста';
  pc006_104_1122           = 'Удаление шаблона "%s".' + #13#10 + 'Вы уверены?';
  pc006_104_1123           = 'Удаление последнего шаблона запрещено';
  pc006_104_1124           = 'Конец периода раньше даты начала бурения. Исправьте, пожалуйста';

  pc006_104_1201           = '%s(%d)';
  pc006_104_1202           = 'График %d не настроен';
  pc006_104_1203           = 'Шаблон № %d';
implementation

end.
