unit uDBVgrafQueryconst;

interface
const
  pc006_101_jMain       = 6101;
  pc006_101_Caption     = 'Подготовить запрос к БД';

  pc006_101_1101           = 'Обнаружена ошибка в поле "День (начало периода)". Исправьте, пожалуйста';
  pc006_101_1102           = 'Обнаружена ошибка в поле "Месяц (начало периода)". Исправьте, пожалуйста';
  pc006_101_1103           = 'Обнаружена ошибка в поле "Год (начало периода)". Исправьте, пожалуйста';
  pc006_101_1104           = 'Указана неверная дата начала периода. Исправьте, пожалуйста';
  pc006_101_1105           = 'Обнаружена ошибка в поле "Час (начало периода)". Исправьте, пожалуйста';
  pc006_101_1106           = 'Обнаружена ошибка в поле "Мин (начало периода)". Исправьте, пожалуйста';

  pc006_101_1110           = 'Обнаружена ошибка в поле "%s". Исправьте, пожалуйста';
  pc006_101_1111           = 'Обнаружена ошибка в поле "День (конец периода)". Исправьте, пожалуйста';
  pc006_101_1112           = 'Обнаружена ошибка в поле "Месяц (конец периода)". Исправьте, пожалуйста';
  pc006_101_1113           = 'Обнаружена ошибка в поле "Год (конец периода)". Исправьте, пожалуйста';
  pc006_101_1114           = 'Указана неверная дата конца периода. Исправьте, пожалуйста';
  pc006_101_1115           = 'Обнаружена ошибка в поле "Час (конец периода)". Исправьте, пожалуйста';
  pc006_101_1116           = 'Конец периода раньше начала периода. Исправьте, пожалуйста';
  pc006_101_1117           = 'Извините, программа не может обрабатывать запросы более чем за 2 суток. Исправьте, пожалуйста';
  pc006_101_1118           = 'Обнаружена ошибка в поле "Мин (конец периода)". Исправьте, пожалуйста';

  pc006_101_1121           = 'Вы не выбрали ни одного параметра для рисования графиков. Исправьте, пожалуйста';
  pc006_101_1122           = 'Удаление шаблона "%s".' + #13#10 + 'Вы уверены?';
  pc006_101_1123           = 'Удаление последнего шаблона запрещено';

  pc006_101_1201           = '%s(%d)';
  pc006_101_1202           = 'График %d не настроен';
  pc006_101_1203           = 'Шаблон № %d';
implementation

end.
