unit uDEPgrafJob1Const;

interface

const
//  pc005_503_ConfigRPTxlsName = 'yyyy.mm.dd hh.nn.ss.zzz'; // Имя файла с рапортом
  pc005_503_ConfigRPTxlsName = 'yyyy.mm.dd hh.nn.ss'; // Имя файла с рапортом
  pc005_503_ConfigRPTxlsType = '.xls';
  pc005_503_ConfigRPTxlsPrfx = 'grf.';

  pc005_503_SGTpar1       = 'Механическая скорость';
  pc005_503_SGTpar2       = 'Время циркуляции';
  pc005_503_SGTpar3       = 'Время бурения';

  pc005_503_SGTpar1sh     = 'М.скор.';
  pc005_503_SGTpar2sh     = 'В.цирк.';
  pc005_503_SGTpar3sh     = 'В.бур.';


  pc005_503_xml1          = '<?xml version="1.0" encoding="UTF-8"?>';
  pc005_503_xml10         = '<Настройка_графиков_СГТ Версия="1">';
  pc005_503_xml11         = '</Настройка_графиков_СГТ>';
  pc005_503_xml12         = 'Настройка_графиков_СГТ';
  pc005_503_xml13         = 'Версия';
  pc005_503_xml14         = '1';

  pc005_503_xml10_01      = '<Графики>';
  pc005_503_xml10_02      = '</Графики>';
  pc005_503_xml10_03      = 'Графики';
  pc005_503_xml10_04      = '<Габариты_листа Высота_листа="%s" Ширина_листа="%s" Отступ_слева="%s" Отступ_справа="%s" Отступ_сверху="%s" Отступ_снизу="%s"/>';
  pc005_503_xml10_05      = 'Габариты_листа';
  pc005_503_xml10_06      = '<Оформление_листа Цвет_рамки="%s" Толщина_рамки="%s" Размер_шрифта_заголовка="%d" тайм_аут="%d"/>';
  pc005_503_xml10_07      = 'Оформление_листа';
  pc005_503_xml10_08      = '<Оформление_графиков Цвет_сетки="%s" Толщина_сетки="%s" Шаг_по_времени="%s" Делитель_сетки_по_Y="%d" Цвет_рамки="%s" Толщина_рамки="%s" Размер_шкалы="%d"/>';
  pc005_503_xml10_09      = 'Оформление_графиков';
  pc005_503_xml10_10      = '<Графический_лист>';
  pc005_503_xml10_11      = '</Графический_лист>';
  pc005_503_xml10_12      = 'Графический_лист';
  pc005_503_xml10_13      = 'Высота_листа';
  pc005_503_xml10_14      = 'Ширина_листа';
  pc005_503_xml10_15      = 'Отступ_слева';
  pc005_503_xml10_16      = 'Отступ_справа';
  pc005_503_xml10_17      = 'Отступ_сверху';
  pc005_503_xml10_18      = 'Отступ_снизу';
  pc005_503_xml10_19      = 'Цвет_рамки';
  pc005_503_xml10_20      = 'Толщина_рамки';
  pc005_503_xml10_21      = 'Размер_шрифта_заголовка';
  pc005_503_xml10_22      = 'тайм_аут';
  pc005_503_xml10_23      = 'Цвет_сетки';
  pc005_503_xml10_24      = 'Толщина_сетки';
  pc005_503_xml10_25      = 'Шаг_по_времени';
  pc005_503_xml10_26      = 'Делитель_сетки_по_Y';
  pc005_503_xml10_27      = 'Цвет_рамки';
  pc005_503_xml10_28      = 'Толщина_рамки';
  pc005_503_xml10_29      = 'Размер_шкалы';
  pc005_503_xml10_30      = '<График Номер="%d" Рисовать="%d">';
  pc005_503_xml10_31      = '</График>';
  pc005_503_xml10_32      = 'График';
  pc005_503_xml10_33      = 'Номер';
  pc005_503_xml10_34      = 'Рисовать';
//  pc005_503_xml10_35      = '<Канал Параметр="%d" Имя="%s" Подпись="%s" Единица="%s" Минимум="%s" Максимум="%s" Цвет="%s" Толщина_линии="%s" Шаг_отрисовки="%s" Размер_надписи="%d" Формат="%s"/>';
  pc005_503_xml10_35      = '<Канал Параметр="%d" Имя="%s" Подпись="%s" Единица="%s" Минимум="%s" Максимум="%s" Цвет="%s" Толщина_линии="%s" Шаг_отрисовки="%s" Размер_надписи="%d"  Точность="%d" Всего_символов="%d"/>';
  pc005_503_xml10_36      = 'Канал';
  pc005_503_xml10_37      = 'Параметр';
  pc005_503_xml10_38      = 'Подпись';
  pc005_503_xml10_39      = 'Единица';
  pc005_503_xml10_40      = 'Минимум';
  pc005_503_xml10_41      = 'Максимум';
  pc005_503_xml10_42      = 'Цвет';
  pc005_503_xml10_43      = 'Толщина_линии';
  pc005_503_xml10_44      = 'Шаг_отрисовки';
  pc005_503_xml10_45      = 'Размер_надписи';
//  pc005_503_xml10_46      = 'Формат';
  pc005_503_xml10_46      = 'Точность';
  pc005_503_xml10_47      = 'Имя';
  pc005_503_xml10_48      = 'Всего_символов';

  pc005_503_xml11_01      = '<Каналы>';
  pc005_503_xml11_02      = '</Каналы>';
  pc005_503_xml11_03      = 'Каналы';



  pc005_503_XMLerr_000    = 0; // Нормальное завершение
  pc005_503_XMLerr_001    = 1; // Отсутствует версия файла
  pc005_503_XMLerr_002    = 2; // Файл конфигурации параметров графиков не содержит конфигурации
  pc005_503_XMLerr_003    = 3; // Файл конфигурации параметров графиков не содержит конфигурации


  pc005_503_cMSG_001 = 'Версия #ver файла конфигурации параметров СГТ не реализована в данной программе'
                        + #13#10 +'Необходимо заново настроить конфигурацию параметров СГТ';

  pc005_503_cMSG_002 = 'Версия файла конфигурации параметров отсутствует'
                        + #13#10 +'Необходимо заново настроить конфигурацию параметров СГТ';

  pc005_503_cMSG_003 = 'Файл конфигурации параметров СГТ не содержит конфигурации'
                        + #13#10 +'Необходимо заново настроить конфигурацию параметров СГТ';

  pc005_503_001           = 'Режим %d';
  pc005_503_002           = 'Этап %d';
  pc005_503_003           = '№ %d';

// Описание встроенных параметров рапорта:
  pc005_503_NumPar_DateTime     =  1;             // Системное время отсчёта
  pc005_503_NumPar_DepthZab     =  2;             // Глубина забоя (21)
  pc005_503_NumPar_Etap         =  3;             // Технический этап работ (23) (Пустой крюк)
  pc005_503_NumPar_Rezhim       =  4;             // Технический режим работ (???) (СПО)
  pc005_503_NumPar_PowerCrk     =  5;             // Вес на крюке (9)
  pc005_503_NumPar_PowerDol     =  6;             // Нагрузка на долото (10)
  pc005_503_NumPar_MomntKey     =  7;             // Момент на ключе (11)
  pc005_503_NumPar_MomntRtr     =  8;             // Момент на роторе (12)
  pc005_503_NumPar_PresrInp     =  9;             // Давление на входе (13)
  pc005_503_NumPar_MechnSpd     = 10;             // Механическая скорость (14)
  pc005_503_NumPar_SPOSpeed     = 11;             // Скорость СПО (15)
  pc005_503_NumPar_TimeCirk     = 12;             // Время циркуляции (16)
  pc005_503_NumPar_TimePres     = 13;             // Время бурения (17)
  pc005_503_NumPar_TimeShrf     = 14;             // Шурф (19)
  pc005_503_NumPar_DepthDol     = 15;             // Положение инструмента

  pc005_503_NamePar_DateTime    = 'Системное время отсчёта';
  pc005_503_NamePar_DepthDol    = 'Положение инструмента (Глубина)';
  pc005_503_NamePar_PowerCrk    = 'Вес на крюке';
  pc005_503_NamePar_PowerDol    = 'Нагрузка на долото';
  pc005_503_NamePar_MomntKey    = 'Момент на ключе';
  pc005_503_NamePar_MomntRtr    = 'Момент на роторе';
  pc005_503_NamePar_PresrInp    = 'Давление на входе';
  pc005_503_NamePar_MechnSpd    = 'Механическая скорость';
  pc005_503_NamePar_SPOSpeed    = 'Скорость СПО';
  pc005_503_NamePar_TimeCirk    = 'Время циркуляции';
  pc005_503_NamePar_TimePres    = 'Время бурения';
  pc005_503_NamePar_TimeShrf    = 'Шурф';
  pc005_503_NamePar_DepthZab    = 'Глубина забоя';
  pc005_503_NamePar_Rezhim      = 'Технический режим работ';
  pc005_503_NamePar_Etap        = 'Технический этап работ';

// Описание режимов бурения:
  pc005_503_RezhimProc_Nam1       = 'Над забоем';                 //К2
  pc005_503_RezhimProc_Nam2       = 'Пустой крюк';                //К2
  pc005_503_RezhimProc_Nam3       = 'Подьем';            //+
  pc005_503_RezhimProc_Nam4       = 'Спуск';             //+
  pc005_503_RezhimProc_Nam5       = 'Промывка';          //+      //К2
  pc005_503_RezhimProc_Nam6       = 'Бурение';           //+      //К2
  pc005_503_RezhimProc_Nam7       = 'Проработка';        //+      //К2
  pc005_503_RezhimProc_Nam8       = 'ПЗР';               //+
  pc005_503_RezhimProc_Nam9       = 'Наращивание';       //+
  pc005_503_RezhimProc_Ind1       = 1;
  pc005_503_RezhimProc_Ind2       = 2;
  pc005_503_RezhimProc_Ind3       = 3;
  pc005_503_RezhimProc_Ind4       = 4;
  pc005_503_RezhimProc_Ind5       = 5;
  pc005_503_RezhimProc_Ind6       = 6;
  pc005_503_RezhimProc_Ind7       = 7;
  pc005_503_RezhimProc_Ind8       = 8;
  pc005_503_RezhimProc_Ind9       = 9;

  pc005_503_EtapProc_Nam1         = 'Пустой крюк';
  pc005_503_EtapProc_Nam2         = 'ПЗР';
  pc005_503_EtapProc_Nam3         = 'СПО';
  pc005_503_EtapProc_Nam4         = 'Бурение';
  pc005_503_EtapProc_Ind1         = 1;
  pc005_503_EtapProc_Ind2         = 2;
  pc005_503_EtapProc_Ind3         = 3;
  pc005_503_EtapProc_Ind4         = 4;

// Описание шаблона
  pc005_503_Shab_Col1             = 14; // Дата отчета
  pc005_503_Shab_Row1             =  2;
  pc005_503_Shab_Col2             =  4; // Глубина(нач. сут.)
  pc005_503_Shab_Row2             =  6;
  pc005_503_Shab_Col3             =  4; // Глубина(кон. сут.)
  pc005_503_Shab_Row3             =  7;
  pc005_503_Shab_Col4             =  4; //  Проходка
  pc005_503_Shab_Row4             =  8;

  pc005_503_Shab_SostProcRowCnt   = 27;
  pc005_503_Shab_SostProcRow      = 13;
  pc005_503_Shab_SostProcCol1     =  2;
  pc005_503_Shab_SostProcCol1a    =  3;
  pc005_503_Shab_SostProcCol1b    =  5;
  pc005_503_Shab_SostProcCol2     =  9;
  pc005_503_Shab_SostProcCol2a    = 10;
  pc005_503_Shab_SostProcCol2b    = 12;

  pc005_503_Shab_SvodkaRow        = 70;
  pc005_503_Shab_SvodkaColspo     =  2;
  pc005_503_Shab_SvodkaColprom    =  3;
  pc005_503_Shab_SvodkaColpror    =  4;
  pc005_503_Shab_SvodkaColbur     =  5;
  pc005_503_Shab_SvodkaColnar     =  6;
  pc005_503_Shab_SvodkaColpzr     =  9;


implementation

end.
