unit uDEPdescript2const;

interface
const
//  pc006_503_AllNull   = 1e20;
//  pc006_503_NullValue = 2e20;
//  pc006_503_NotValid  = 3e20;

//  pc006_503_001       = 'Необходимо немедленно настроить программу - указать путь DEP ресурсам';
  pc006_503_002       = 'Операция № %d не известна';
//  pc006_503_003       = '№ %d';
//  pc006_503_004       = 'Режим %d';

//  pc006_503_SGTpar1       = 'Системное время';
//  pc006_503_SGTpar1sh     = 'Время';

  pc006_503_SGTpar1       = 'Технологический Этап';
  pc006_503_SGTpar1sh     = 'Этап';
  pc006_503_SGTpar1nb     = 1;

  pc006_503_SGTpar2       = 'Глубина забоя';
  pc006_503_SGTpar2sh     = 'H';
  pc006_503_SGTpar2nb     = 2;

  // Описание режимов бурения:
  pc006_503_Rezhim_DoNotKnow     = -1;
  pc006_503_Rezhim_Mixed = 0; // Смесь режимов
  pc006_503_Rezhim_Zaboj_PZR_PZR =    0 +   0 + 1; // Над Забоем  / ПЗР     / ПЗР
  pc006_503_Rezhim_Zaboj_SPO_SPO =    0 +  64 + 2; // Над Забоем  / СПО     / СПО
  pc006_503_Rezhim_Zaboj_SPO_PRM =    0 +  64 + 3; // Над Забоем  / СПО     / Промывка
  pc006_503_Rezhim_Zaboj_SPO_PRB =    0 +  64 + 4; // Над Забоем  / СПО     / Проработка
  pc006_503_Rezhim_Zaboj_BUR_PRM =    0 + 128 + 3; // Над Забоем  / Бурение / Промывка
  pc006_503_Rezhim_Zaboj_BUR_PRB =    0 + 128 + 4; // Над Забоем  / Бурение / Проработка
  pc006_503_Rezhim_Zaboj_BUR_NRV =    0 + 128 + 5; // Над Забоем  / Бурение / Наращивание
  pc006_503_Rezhim_Zaboj_BUR_BUR =    0 + 128 + 6; // Над Забоем  / Бурение / Бурение
  pc006_503_Rezhim_Pusto_PZR_PZR = 1024 +   0 + 1; // Пустой крюк / ПЗР     / ПЗР
  pc006_503_Rezhim_Pusto_SPO_SPO = 1024 +  64 + 2; // Пустой крюк / СПО     / СПО
  pc006_503_Rezhim_Pusto_BUR_NRV = 1024 + 128 + 5; // Пустой крюк / Бурение / Наращивание

  // Описание названий режимов бурения:
  pc006_503_RzName_Mixed         = 'Смесь операций';
  pc006_503_RzName_Zaboj_PZR_PZR = 'Над Забоем  / ПЗР     / ПЗР';
  pc006_503_RzName_Zaboj_SPO_SPO = 'Над Забоем  / СПО     / СПО';
  pc006_503_RzName_Zaboj_SPO_PRM = 'Над Забоем  / СПО     / Промывка';
  pc006_503_RzName_Zaboj_SPO_PRB = 'Над Забоем  / СПО     / Проработка';
  pc006_503_RzName_Zaboj_BUR_PRM = 'Над Забоем  / Бурение / Промывка';
  pc006_503_RzName_Zaboj_BUR_PRB = 'Над Забоем  / Бурение / Проработка';
  pc006_503_RzName_Zaboj_BUR_NRV = 'Над Забоем  / Бурение / Наращивание';
  pc006_503_RzName_Zaboj_BUR_BUR = 'Над Забоем  / Бурение / Бурение';
  pc006_503_RzName_Pusto_PZR_PZR = 'Пустой крюк / ПЗР     / ПЗР';
  pc006_503_RzName_Pusto_SPO_SPO = 'Пустой крюк / СПО     / СПО';
  pc006_503_RzName_Pusto_BUR_NRV = 'Пустой крюк / Бурение / Наращивание';

  pc006_503_XMLerr_000    = 0; // Нормальное завершение
  pc006_503_XMLerr_001    = 1; // Отсутствует версия файла
  pc006_503_XMLerr_002    = 2; // Файл конфигурации параметров СГТ не содержит конфигурации
  pc006_503_XMLerr_003    = 3; // Файл конфигурации параметров СГТ не содержит конфигурации

  pc006_503_cMSG_001 = 'Версия #ver файла конфигурации параметров СГТ не реализована в данной программе'
                        + #13#10 +'Необходимо заново настроить конфигурацию параметров СГТ';

  pc006_503_cMSG_002 = 'Версия файла конфигурации параметров отсутствует'
                        + #13#10 +'Необходимо заново настроить конфигурацию параметров СГТ';

  pc006_503_cMSG_003 = 'Файл конфигурации параметров СГТ не содержит конфигурации'
                        + #13#10 +'Необходимо заново настроить конфигурацию параметров СГТ';

  pc006_503_xml1          = '<?xml version="1.0" encoding="UTF-8"?>';
  pc006_503_xml10         = '<Настройка_параметров_СГТ Версия="1">';
  pc006_503_xml11         = '</Настройка_параметров_СГТ>';
  pc006_503_xml12         = 'Настройка_параметров_СГТ';
  pc006_503_xml13         = 'Версия';
  pc006_503_xml14         = '1';

  pc006_503_xml10_01      = '<Параметры_СГТ>';
  pc006_503_xml10_01_01   = '<Параметр SGTparNum="%d" DEPparNum="%d" SGTparNameBig="%s" SGTparNameShrt="%s"></Параметр>';
  pc006_503_xml10_01_02   = 'Параметры_СГТ';
  pc006_503_xml10_01_03   = 'Параметр';
  pc006_503_xml10_01_04   = 'SGTparNum';
  pc006_503_xml10_01_05   = 'DEPparNum';
  pc006_503_xml10_01_06   = 'SGTparNameBig';
  pc006_503_xml10_01_07   = 'SGTparNameShrt';
  pc006_503_xml10_01_11   = 'Значения_По_Умолчанию';
  pc006_503_xml10_01_12   = '<Значения_По_Умолчанию NullValue="%s" NotValid="%s" Delimeter="%s" Precision="%d" Digits="%d" DataType="%d">';
  pc006_503_xml10_01_13   = 'NullValue';
  pc006_503_xml10_01_14   = 'NotValid';
  pc006_503_xml10_01_15   = 'Delimeter';
  pc006_503_xml10_01_16   = 'Precision';
  pc006_503_xml10_01_17   = 'Digits';
  pc006_503_xml10_01_18   = 'DataType';
  pc006_503_xml10_01_19   = '</Значения_По_Умолчанию>';
  pc006_503_xml10_01_20   = '<Значения_По_Умолчанию>';
  pc006_503_xml10_02      = '</Параметры_СГТ>';
  pc006_503_xml10_03      = '<ПутьКописаниям>%s</ПутьКописаниям>';
  pc006_503_xml10_03_01   = 'ПутьКописаниям';
  pc006_503_xml10_04      = '<ПутьКданным>%s</ПутьКданным>';
  pc006_503_xml10_04_01   = 'ПутьКданным';
  pc006_503_xml10_05      = '<ПутьКдокументам>%s</ПутьКдокументам>';
  pc006_503_xml10_05_01   = 'ПутьКдокументам';

implementation

end.
