unit uEditParamConst;

interface

const
  pc003_132_jMain       = 132;
  pc003_132_Caption     = 'Редактирование параметра';

  pc003_132_AcceptMsg   = 131; // Сообщение "Применить изменения"

  pc003_132_001         = 34;
  pc003_132_002         = 17;

  pc003_132_011         = 'Ошибка в значении таймаута. Расчёт невозможен';
  pc003_132_012         = 'Ошибка в значении шага по времени. Расчёт невозможен';
  pc003_132_013         = 'Выберите закладку метод обработки параметра, пожалуйста';
  pc003_132_014         = 'Выберите параметр для обработки, пожалуйста';
  pc003_132_015         =
                          'Задание на обработку:' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Номер канала = "%d"' + #13#10 +
                          'Алгоритм обработки "%s"' + #13#10 +
                          'Модификация алгоритма "%s"' + #13#10 +
                          'Коэффициент шума = "%s"' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Приступить к выполнению?';
  pc003_132_016         =
                          'Задание на обработку:' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Номер канала = "%d"' + #13#10 +
                          'Алгоритм обработки: "%s"' + #13#10 +
                          'Модификация алгоритма: "%s"' + #13#10 +
                          'Значение в начале интервала = "%s"' + #13#10 +
                          'Значение в  конце интервала = "%s"' + #13#10 +
                          'Коэффициент шума = "%s"' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Приступить к выполнению?';
  pc003_132_017         = 'Ошибка в значении параметра в начале интервала. Расчёт невозможен';
  pc003_132_018         = 'Ошибка в значении параметра в конце интервала. Расчёт невозможен';
  pc003_132_019         = 'Ошибка в значении коэффициента шума. Расчёт невозможен';
  pc003_132_020         = 'Отсутствуют значения на обох концах интервала. Примените другой метод восстановления значения';


  pc003_132_021         =
                          'Задание на обработку:' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Номер канала = "%d"' + #13#10 +
                          'Коэффициент шума = "%5.2f"' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Выполнено !';
  pc003_132_022         =
                          'Задание на обработку:' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Номер канала = "%d"' + #13#10 +
                          'Значение в начале интервала = "%8.3f"' + #13#10 +
                          'Значение в  конце интервала = "%8.3f"' + #13#10 +
                          'Коэффициент шума = "%5.2f"' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Выполнено !';
  pc003_132_023         =
                          'Задание на обработку:' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Номер канала = "%d"' + #13#10 +
                          'Алгоритм обработки "%s"' + #13#10 +
                          'Модификация алгоритма "%s"' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Приступить к выполнению?';
  pc003_132_024         = 'Ошибка в Сдвиге параметра. Расчёт невозможен';
  pc003_132_025         = 'Ошибка в Множителе параметра. Расчёт невозможен';
  pc003_132_028         =
                          'Задание на обработку:' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Номер канала = "%d"' + #13#10 +
                          'Алгоритм обработки "%s"' + #13#10 +
                          'Модификация алгоритма "%s"' + #13#10 +
                          'Сдвиг параметра "%s"' + #13#10 +
                          'Множитель параметра "%s"' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Приступить к выполнению?';
  pc003_132_029         =
                          'Задание на обработку:' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Номер канала = "%d"' + #13#10 +
                          'Алгоритм обработки "%s"' + #13#10 +
                          'Модификация алгоритма "%s"' + #13#10 +
                          'Коэффициент шума = "%s"' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Приступить к выполнению?';
  pc003_132_030         =
                          'Задание на обработку:' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Номер канала = "%d"' + #13#10 +
                          'Сдвиг параметра "%8.3f"' + #13#10 +
                          'Множитель параметра "%8.3f"' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Выполнено !';
  pc003_132_031         =
                          'Задание на обработку:' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Номер канала = "%d"' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Выполнено !';

implementation

end.
