unit uEditParam2Const;

interface

const
  pc005_111_jMain       = 5111;
  pc005_111_Caption     = 'Редактирование параметра';

  pc005_111_AcceptMsg   = 131; // Сообщение "Применить изменения"

  pc005_111_001         = 34;
  pc005_111_002         = 17;

  pc005_111_011         = 'Ошибка в значении таймаута. Расчёт невозможен';
  pc005_111_012         = 'Ошибка в значении шага по времени. Расчёт невозможен';
  pc005_111_013         = 'Выберите закладку метод обработки параметра, пожалуйста';
  pc005_111_014         = 'Выберите параметр для обработки, пожалуйста';
  pc005_111_015         =
                          'Задание на обработку:' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Номер канала = "%d"' + #13#10 +
                          'Алгоритм обработки "%s"' + #13#10 +
                          'Модификация алгоритма "%s"' + #13#10 +
                          'Коэффициент шума = "%s"' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Приступить к выполнению?';
  pc005_111_016         =
                          'Задание на обработку:' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Номер канала = "%d"' + #13#10 +
                          'Алгоритм обработки: "%s"' + #13#10 +
                          'Модификация алгоритма: "%s"' + #13#10 +
                          'Значение в начале интервала = "%s"' + #13#10 +
                          'Значение в  конце интервала = "%s"' + #13#10 +
                          'Коэффициент шума = "%s"' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Приступить к выполнению?';
  pc005_111_017         = 'Ошибка в значении параметра в начале интервала. Расчёт невозможен';
  pc005_111_018         = 'Ошибка в значении параметра в конце интервала. Расчёт невозможен';
  pc005_111_019         = 'Ошибка в значении коэффициента шума. Расчёт невозможен';
  pc005_111_020         = 'Отсутствуют значения на обох концах интервала. Примените другой метод восстановления значения';


  pc005_111_021         =
                          'Задание на обработку:' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Номер канала = "%d"' + #13#10 +
                          'Коэффициент шума = "%5.2f"' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Выполнено !';
  pc005_111_022         =
                          'Задание на обработку:' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Номер канала = "%d"' + #13#10 +
                          'Значение в начале интервала = "%8.3f"' + #13#10 +
                          'Значение в  конце интервала = "%8.3f"' + #13#10 +
                          'Коэффициент шума = "%5.2f"' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Выполнено !';
  pc005_111_023         =
                          'Задание на обработку:' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Номер канала = "%d"' + #13#10 +
                          'Алгоритм обработки "%s"' + #13#10 +
                          'Модификация алгоритма "%s"' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Приступить к выполнению?';
  pc005_111_024         = 'Ошибка в Сдвиге параметра. Расчёт невозможен';
  pc005_111_025         = 'Ошибка в Множителе параметра. Расчёт невозможен';
  pc005_111_028         =
                          'Задание на обработку:' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Номер канала = "%d"' + #13#10 +
                          'Алгоритм обработки "%s"' + #13#10 +
                          'Модификация алгоритма "%s"' + #13#10 +
                          'Сдвиг параметра "%s"' + #13#10 +
                          'Множитель параметра "%s"' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Приступить к выполнению?';
  pc005_111_029         =
                          'Задание на обработку:' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Номер канала = "%d"' + #13#10 +
                          'Алгоритм обработки "%s"' + #13#10 +
                          'Модификация алгоритма "%s"' + #13#10 +
                          'Коэффициент шума = "%s"' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Приступить к выполнению?';
  pc005_111_030         =
                          'Задание на обработку:' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Номер канала = "%d"' + #13#10 +
                          'Сдвиг параметра "%8.3f"' + #13#10 +
                          'Множитель параметра "%8.3f"' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Выполнено !';
  pc005_111_031         =
                          'Задание на обработку:' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Номер канала = "%d"' + #13#10 +
                          '----------------------------------' + #13#10 +
                          'Выполнено !';

implementation

end.
