unit uGrafTune1const;

interface

const
  pc005_109_jMain       = 5109;
  pc005_109_Caption     = 'Настройка Параметров Графика';

//  pc005_109_frm_01      = '<%d> %s';
  pc005_109_frm_02      = 'Обнаружена ошибка в поле <%s>';
  pc005_109_frm_03      = 'Значение поля "%s" не может быть < 0!';
  pc005_109_frm_04      = 'Значение поля "%s" должно быть >  значения поля "%s"!';

  pc003_129_frm_02      = '%3d %6s[%6s] (%s)';

  pc003_129_err_01      = 'Укажите, пожалуйста, значение параметра';

  pc005_109_001         = 'Выберите, пожалуйста, параметр в БД и настройте свойства графика';

implementation

end.
