unit uSetTimeConst;

interface

const
  pc006_03_ProjectName = 'SetTime v.1';
  pc006_03_Caption     = 'СГТ Уралмаш. Установить часы БО, вер.1.0';
  pc006_03_MainGUID    = '{11175F4C-3168-4104-B510-5AE56C4D44F8}';
  pc006_03_SoftPath    = '\Software\SKB OREOL\СГТ_ТТ80\' +   pc006_03_MainGUID;

  pc006_03_PathWord0   = 'SKBOREOL_ADMIN';

  pc006_03_Top0 = 7;
  pc006_03_Lft0 = 7;

  pc006_03_01  = 'Связь с Сервером данных установлена';
  pc006_03_02  = 'Связь с Сервером данных отсутствует';

  pc006_03_11  = 'Необходимо предварительно настроить параметры сети?!!';
  pc006_03_12  = 'Необходимо указать положение файла с настройками?!!';
  pc006_03_13  = 'Необходимо предварительно установить связь с сервером?!!';
  pc006_03_14  = 'Необходимо предварительно настроить параметры БКСД?!!';
  pc006_03_15  = 'Пароль не верен, настройки программы заблокированы';

  pc006_03_21  = 'Вы в самом деле хотите закрыть программу?';
  pc006_03_22  = 'Вы в самом деле хотите синхронизовать время?';
implementation

end.
