unit uShowSGTparam1const;

interface

const
  pc005_104_jMain       = 5104;
  pc005_104_Caption     = 'Таблица параметров СГТ';

  pc005_104_01   = '№';
  pc005_104_02   = 'Описание параметра';
  pc005_104_03   = 'Кратко';
  pc005_104_04   = '№ Парам БД';
  pc005_104_05   = 'Имя параметра БД';

  pc005_104_eps  = 7;

  pc005_104_001  = 'Выберите мышкой строку для редактирования, пожалуйста';
  pc005_104_002  = '<%d>';
  pc005_104_003  = 'Параметр не определён';
  pc005_104_004  = '<%d> %s';
  pc005_104_005  = 'Таблица параметров используется, дождатесь завершения предыдущего задания';

implementation

end.
